Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/civil_annulment/consequences_of_a_civil_annulment_of_marriage.html.txt.tmx
Source language: en
Languages: ga

source: Consequences of a civil annulment of marriage
ga: Iarmhairtí neamhnithe sibhialta pósta

source: Whether or not your marriage is void or voidable, the legal consequences of a civil annulment of your marriage are the same
ga: Cibé an bhfuil nó nach bhfuil do phósadh neamhnitheach nó in-neamhnaithe, is iad na hiarmhairtí dlíthiúla céanna a bheidh ag neamhniú sibhialta ar do phósadh

source: Your marriage is declared to be invalid from the start
ga: Dearbhaítear go raibh do phósadh neamhbhailí ón tús

source: Therefore, your marriage never legally happened
ga: Dá bhrí sin níor tharla do phósadh go dlíthiúil riamh

source: The most obvious consequence of a court declaration of nullity is that you are now entitled to marry
ga: Is é an iarmhairt is follasaí de dhearbhú cúirte nár tharla do phósadh riamh ná go bhfuil tú anois i dteideal pósadh

source: If you do get married after a civil annulment, you are not committing bigamy, as your new marriage is your only valid one
ga: Bheadh do phósadh nua bailí agus ní bheadh tú ag déanamh biogamaíochta mar nach bhfuil tú pósta go bailíoch ach uair amháin

source: If you have already remarried, that is, you have married before an order of annulment was actually made by the court, your second marriage may have appeared invalid and bigamous
ga: Má tá tú tar éis athphósadh a dhéanamh cheana, i.e. gur tharla sé gur phós tú sul má ndearna an chúirt an t-ordú faoi neamhniú, bhreathnódh sé go mbeadh do dhára pósadh neamhbhailí agus biogamach

source: However, once the annulment order is granted, your second marriage is validated, as your first marriage has now been declared invalid
ga: Chomh luath agus a dheonaítear an t-ordú faoi neamhniú, déantar do dhára pósadh bailí mar go raibh do chéad phósadh neamhbhailí

source: If your marriage is annulled, it also means that you lose the rights that you enjoyed as a married person
ga: Má tá do phósadh neamhnitheach, ciallaíonn sé freisin go gcailleann tú na cearta a bhí agat mar dhuine pósta

source: • The home that you shared with your former partner is not a family home
ga: • Ní teach an teaghlaigh, é an teach a roinn tú le do iarpháirtnéir

source: If your former partner is the legal owner of the house, they can sell or lease it without your consent
ga: Más é/í do iarpháirtnéir úinéir dlíthiúil an tí, is féidir leis nó léi an teach a dhíol nó a ligean ar léas gan do thoiliú

source: • Under the Succession Act 1965, when a married person dies, their spouse is legally entitled to a share of their estate whether or not they have left a will
ga: • Faoin Acht Comharbais 1965, nuair a fhaigheann duine pósta bás, go dlíthiúil tá a c(h)éile i dteideal scar den eastát, cibé ar fhág nó nár fhág sé nó sí uacht

source: • Once your marriage has been annulled, you do not have a right to apply to the court to order your former partner to pay maintenance to support you, as only spouses may apply to a court for an order for maintenance
ga: • Chomh luath agus atá neamhniú déanta ar do phósadh níl aon cheart agat iarratas a dhéanamh ar an gcúirt chun ordú a fháil go n-íocfadh do iarpháirtnéir cothabháil chun cuidiú leat, mar gur céilí amháin ar féidir leo iarratas a dhéanamh ar an gcúirt le haghaidh cothabhála

source: However, if there were children born during the annulled marriage, you may apply to the court to order your former partner to pay child support
ga: Má rugadh leanaí áfach, le linn an phósta neamhnaithe, is féidir leat iarratas a dhéanamh ar an gcúirt chun ordú a fháil go ndéanfadh do iarpháirtnéir íocaíocht tacú linbh

source: • If your marriage is annulled, it will also have consequences for your children
ga: • Má tá do phósadh neamhnitheach, beidh iarmhairtí aige freisin ar do leanaí

source: However, the Status of Children Act 1987 protects the legal rights of children whose parents are not married to each other
ga: Mar sin féin cosnaíonn an tAcht um Stádas Leanaí 1987, cearta dlíthiúla na leanaí nach bhfuil a dtuismitheoirí pósta lena chéile

source: Under the Succession Act 1965, if you die and do not provide for your child adequately in your will, that child may apply to the court for a share of your estate
ga: Faoin Acht Comharbais 1965, má fhaigheann tú bás agus nach ndéanann tú soláthar cuí le haghaidh do leanbh i do uacht, is féidir leis an leanbh sin iarratas a dhéanamh chuig an gcúirt le haghaidh scar de do eastát

source: If you die without a will, your children have an automatic right to a share in your estate
ga: Má fhaigheann tú bás gan aon uacht, tá ceart uathoibreach ag do leanaí ar do eastát

source: These rights apply equally to children born outside of marriage and children born within marriage, so an annulment of your marriage will not affect your children's succession rights
ga: Baineann na cearta seo go cothrom le leanaí a rugadh taobh amuigh de phósadh agus leanaí a rugadh taobh istigh de phósadh, agus mar sin ní bheidh aon éifeacht ag neamhniú do phósadh ar chearta comharbais do leanaí

source: • The right of a father to be a guardian of his child is affected by an annulment of marriage
ga: • Cuireann neamhniú an phósta isteach ar cheart an athar a bheith ina chaomhnóir ar an leanbh

source: Normally, when a child is born to married parents, both parents are the joint guardians of the child
ga: De ghnáth nuair a bheirtear leanbh do thuismitheoirí pósta, bíonn an bheirt thuismitheoir mar chomhchaomhnóirí ag an leanbh

source: When a marriage is annulled, the father will only be regarded as a joint guardian of the child if he reasonably believed that his marriage ceremony was valid, and if the child was born before the annulment order, or less than 10 months after it
ga: Nuair a dhéantar pósadh a neamhniú, breathnaítear ar an athair mar chomhchaomhnóir don leanbh sa chás gur chreid sé go raibh a shearmanas pósta bailí agus gur rugadh an leanbh roimh nó taobh istigh de dheich mí ón ordú faoi neamhniú

source: It is important to be aware that a church annulment does not have any legal effect
ga: Tá sé tábhachtach fios a bheith agat nach bhfuil aon éifeacht dhlíthiúil ag neamhniú ón eaglais

source: It does not mean that you may legally remarry - although it may mean that you can remarry in the eyes of the church
ga: Ní chiallaíonn sé gur féidir leat athphósadh go dlíthiúil - fiú má chiallaíonn sé gur féidir leat athphósadh i súile na heaglaise
